read_verilog ../testenv/builds/.grouped/grouped.v
read_verilog -lib +/ecp5/cells_sim.v +/ecp5/cells_bb.v
hierarchy -check -top \$top

proc

check
memory -nomap
opt_clean
memory_map
techmap -map +/techmap.v -map +/ecp5/arith_map.v
dffsr2dff
dff2dffs
opt_clean
dff2dffe -direct-match $_DFF_* -direct-match $__DFFS_*
techmap -D NO_LUT -map +/ecp5/cells_map.v
simplemap
ecp5_ffinit
techmap -map +/ecp5/latches_map.v
abc -lut 4:7 -dress

clean
hierarchy -check
stat
check -noinit
